<?php

return [

    'name' => [
        'required' => 'الاسم مطلوب',
        'string' => 'الاسم لازم يكون نص',
        'min' => 'الاسم لازم يكون 3 حروف على الأقل',
        'max' => 'الاسم كبير جدًا',
        'regex' => 'الاسم لازم يحتوي على حروف فقط',
    ],

    'email' => [
        'required' => 'البريد الإلكتروني مطلوب',
        'email' => 'البريد الإلكتروني غير صالح',
        'unique' => 'البريد الإلكتروني مستخدم بالفعل',
    ],

    'phone' => [
        'required' => 'رقم الهاتف مطلوب',
        'regex' => 'رقم الهاتف غير صحيح',
        'unique' => 'رقم الهاتف مستخدم بالفعل',
    ],

    'login' => [
        'required' => 'بيانات الادخال مطلوبة',
        'invald' => 'البيانات غير صحيحة',
    ],

    'password' => [
        'required' => 'كلمة المرور مطلوبة',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق',
        'min' => 'كلمة المرور يجب أن تكون 8 أحرف على الأقل',
        'rules' => 'كلمة المرور لازم تحتوي على:
        - حروف (a-z)
        - حرف كبير (A-Z)
        - رقم (0-9)
        - رمز خاص (@$!%*?&)
        - على الأقل 8 أحرف',
    ],

];
